// Задание 1

// let i = 0;      
// while (i < 2) {
//     console.log('Привет');
//     i++;
// }


// Задание 2

// let i = 1;      
// while (i <= 5) {
//     console.log(i);
//     i++;
// }


// Задание 3

// let i = 7;      
// while (i <= 22) {
//     console.log(i);
//     i++;
// }


// Задание 4

// const salary = {
//     'Коля': '200',
//     'Вася': '300',
//     'Петя': '400',
// };
// for (let name in salary) {
//     console.log(`${name} - зарплата ${salary[name]} долларов`);
// }


// Задание 5

// let n = 1000;
// let num = 0;
// while (n >= 50) {
//   num++; // *ВАЖНО ДЛЯ СЕБЯ* просто счетчик. каждую итерацию деления добавляет +1 в переменную 
//   n /= 2; // *ВАЖНО ДЛЯ СЕБЯ*  /= записывает результат операции вместо назначеного ранее значения переменной
// }
// console.log(n);
// console.log(num);


// Задание 6

// let fridayNumber = 5;
// while (fridayNumber <=31) {
//   console.log(`Сегодня пятница, ${fridayNumber}-е число. Необходимо подготовить отчет.`);
//   fridayNumber += 7;
// }